#include "global.h"

#include <new>

#include "database.hpp"
#include "map.hpp"
#include "proc_ex.hpp"
#include "unit.hpp"

struct DisposGroupProcessor;

class Disposition : public ProcEx
{
public:
    /* 38 */ DisposGroupProcessor * head;
    /* 3C */ DisposGroupProcessor * tail;
    /* 40 */ s32 unk_40;

    Disposition()
    {
        this->head = NULL;
        this->tail = NULL;
    }

    virtual ~Disposition()
    {
    }

    virtual void Loop(void); // func_ov000_021db09c

    void func_ov000_021d9d7c(DisposGroupProcessor *);
    void func_ov000_021d9da8(DisposGroupProcessor *);
    void func_ov000_021db3c4(void);
};

struct SpawnItem
{
    /* 00 */ u8 unk_00; // id
    /* 01 */ u8 unk_01; // flags, &1 is droppable
};

struct Spawn
{
    /* 00 */ u16 pid;
    /* 02 */ u16 jid;
    /* 04 */ s8 xLoad;
    /* 05 */ s8 yLoad;
    /* 06 */ s8 xFinal;
    /* 07 */ s8 yFinal;
    /* 08 */ u8 faction;
    /* 09 */ u8 unk_09;
    /* 0A */ u8 startingLevel;
    /* 0B */ u8 unk_0b;
    /* 0C */ s32 unk_0c;
    /* 10 */ struct SpawnItem unk_10[5];
    /* 1A */ STRUCT_PAD(0x1A, 0x1C);
    /* 1C */ s8 unk_1c[8];
    /* 24 */ u16 flags;
    /* 26 */ u16 unk_26;
    /* 28 */ s32 unk_28[4]; // AI pointers
    /* 38 */ s32 unk_38[4];
    /* 48 */ u8 unk_48;
    /* 49 */ u8 unk_49;
    /* 4A */ u16 unk_4a;
    /* 4C */ u8 unk_4c;
    /* 4D */ u8 unk_4d;
    /* 4E */ STRUCT_PAD(0x4e, 0x50);

    void func_ov000_021d9adc(struct JobData * job);
    void func_ov000_021d9bb0(struct JobData * job, s32 x, s32 y, s32 flags);
    void func_ov000_021d9c94(struct Unit * unit);
    void func_ov000_021d9ca8(struct Unit * unit, s8 x, s8 y);
};

struct DisposGroup
{
    /* 00 */ char * label;
    /* 04 */ struct Spawn * spawns;
    /* 08 */ s32 count;
};

struct SpawnState
{
    /* 00 */ u8 unitId;
    /* 01 */ u8 flags;
    /* 02 */ s8 xPos;
    /* 03 */ s8 yPos;

    SpawnState();
};

EC s32 func_020b6e2c(char *, char *);

struct DisposGroupProcessor
{
    /* 00 */ Disposition * proc;
    /* 04 */ DisposGroupProcessor * prev;
    /* 08 */ DisposGroupProcessor * next;
    /* 0C */ char * label;
    /* 10 */ struct DisposGroup * disposGroup;
    /* 14 */ struct Spawn * spawns;
    /* 18 */ struct SpawnState * spawnStates;
    /* 1C */ u16 unk_1c;
    /* 1E */ u16 unk_1e;
    /* 20 */ u32 flags;

    DisposGroupProcessor(Disposition * proc, char * label, u32 flags)
    {
        DisposGroup * group;

        this->spawnStates = NULL;
        this->flags = flags;
        this->label = label;
        this->proc = proc;
        proc->func_ov000_021d9d7c(this);
        this->unk_1c = 0;

        group = static_cast<DisposGroup *>(gMapStateManager->unk_18);

        if (group == NULL)
        {
            delete this;
        }
        else
        {
            while (TRUE)
            {
                if (group->label == NULL)
                {
                    group = NULL;
                    break;
                }

                if (func_020b6e2c(label, group->label) == 0)
                {
                    break;
                }

                group++;
            }

            this->disposGroup = group;

            if (group == NULL)
            {
                delete this;
            }
            else
            {
                this->spawns = group->spawns;
                this->func_ov000_021daac8();
            }
        }
    }

    ~DisposGroupProcessor()
    {
        this->func_ov000_021d9e38();
        this->proc->func_ov000_021d9da8(this);
    }

    void func_ov000_021d9df0(void);
    void func_ov000_021d9e38(void);
    struct Unit * func_ov000_021d9e50(s32 pid, s32 faction);
    struct Unit * func_ov000_021d9e7c(s32 faction);
    struct Unit * func_ov000_021d9ebc(s32 index, BOOL param_3);
    BOOL func_ov000_021da030(s32 x, s32 y);
    BOOL func_ov000_021da088(s32 x, s32 y);
    void func_ov000_021da0fc(s32 index);
    void func_ov000_021da230(s32 index, s32 param_3);
    void func_ov000_021da3c0(s32 index, s32 param_3);
    void func_ov000_021da7e4(void);
    void func_ov000_021da8f4(void);
    void func_ov000_021daac8(void);
    void func_ov000_021dab34(BOOL param_2, BOOL param_3);
    void func_ov000_021dac48(void);
    void func_ov000_021dad04(void);
    void func_ov000_021db160(void);
    void func_ov000_021db1f4(void);
};

struct TMP
{
    STRUCT_PAD(0x00, 0x54);
    u16 unk_54;
    STRUCT_PAD(0x56, 0x68);
    u32 unk_68;
};

EC struct TMP * func_ov000_021bb4c8(void *);
EC struct TMP * func_ov000_021bb210(void *, struct Unit *);

EC s32 GetPersonDBIndex(struct PersonData *);

EC void func_02039ff8(struct Unit *, Spawn *);
EC void func_0203bd34(struct Unit *, s32, s32);

EC void func_01ff8204(void *, s8, s8, s32, s32, u16);

struct UnkStruct_02196f0c
{
    /* 00 */ struct UnkStruct_02196f0c_00 * unk_00;
    /* 04 */ void * flagMgr;
    /* 08 */ void * valueMgr;
    /* 0C */ u32 state;
    /* 10 */ u32 unk_10;
    /* 14 */ u32 unk_14;
};

extern struct UnkStruct_02196f0c * data_02196f0c;

EC BOOL FindUnitByPidAndFaction(s32, s32);

EC BOOL func_ov000_021a47e4(void);

EC BOOL func_ov000_021bb5d4(void *, s32, s32);

EC void func_0204bf74(void);

struct UnkStruct_021e3528
{
    s8 unk_00[0x2e];
    s8 unk_2e;
    s8 unk_2f;
};

extern struct UnkStruct_021e3528 data_ov000_021e3528;

static inline BOOL BoundsCheck(s32 param_1, s32 param_2)
{
    if (param_1 < gMapStateManager->unk_24)
    {
        return TRUE;
    }
    else if (param_2 < gMapStateManager->unk_25)
    {
        return TRUE;
    }
    else if (param_1 >= gMapStateManager->unk_26)
    {
        return TRUE;
    }
    else if (param_2 >= gMapStateManager->unk_27)
    {
        return TRUE;
    }

    return FALSE;
}

extern struct Unit gUnitList[];

EC BOOL func_ov000_021baafc(void *, struct Unit *, BOOL);

EC void func_ov000_021a3974(void *, s32);
EC void func_ov000_021a340c(void);
EC void func_ov000_021a35a0(void);

