#include "global.h"

#include <new>

#include "map.hpp"
#include "proc_ex.hpp"
#include "unit.h"

struct astruct_27;

class Disposition : public ProcEx
{
public:
    /* 38 */ astruct_27 * unk_38;
    /* 3C */ astruct_27 * unk_3c;
    /* 40 */ s32 unk_40;

    Disposition()
    {
        this->unk_38 = NULL;
        this->unk_3c = NULL;
    }

    virtual ~Disposition()
    {
    }
};

struct SpawnItem
{
    /* 00 */ u8 unk_00; // id
    /* 01 */ u8 unk_01; // flags, &1 is droppable
};

struct Spawn
{
    /* 00 */ u16 pid;
    /* 02 */ u16 jid;
    /* 04 */ s8 xLoad;
    /* 05 */ s8 yLoad;
    /* 06 */ s8 unk_06;
    /* 07 */ s8 unk_07;
    /* 08 */ u8 unk_08;
    /* 09 */ u8 unk_09;
    /* 0A */ u8 startingLevel;
    /* 0B */ u8 unk_0b;
    /* 0C */ s32 unk_0c;
    /* 10 */ struct SpawnItem unk_10[5];
    /* 1A */ STRUCT_PAD(0x1A, 0x1C);
    /* 1C */ s8 unk_1c[8];
    /* 24 */ u16 flags;
    /* 26 */ u16 unk_26;
    /* 28 */ s32 unk_28[4]; // AI pointers
    /* 38 */ s32 unk_38[4];
    /* 48 */ u8 unk_48;
    /* 49 */ u8 unk_49;
    /* 4A */ u16 unk_4a;
    /* 4C */ u8 unk_4c;
    /* 4D */ u8 unk_4d;
    /* 4E */ STRUCT_PAD(0x4e, 0x50);
};

// DisposGroup
struct DisposGroup
{
    /* 00 */ char * unk_00; // label
    /* 04 */ struct Spawn * unk_04; // spawns
    /* 08 */ s32 unk_08; // count
};

struct astruct_27_18
{
    /* 00 */ u8 unk_00;
    /* 01 */ u8 unk_01;
    /* 02 */ s8 unk_02;
    /* 03 */ s8 unk_03;

    astruct_27_18();
};

EC void func_ov000_021d9d7c(Disposition *, astruct_27 *);
EC void func_ov000_021d9e38(astruct_27 *);
EC void func_ov000_021daac8(astruct_27 *);
EC void func_ov000_021d9da8(Disposition *, astruct_27 *);

EC s32 func_020b6e2c(char *, char *);

struct astruct_27
{
    /* 00 */ Disposition * unk_00;
    /* 04 */ astruct_27 * unk_04;
    /* 08 */ astruct_27 * unk_08;
    /* 0C */ char * unk_0c;
    /* 10 */ struct DisposGroup * unk_10;
    /* 14 */ struct Spawn * unk_14;
    /* 18 */ struct astruct_27_18 * unk_18;
    /* 1C */ u16 unk_1c;
    /* 1E */ u16 unk_1e;
    /* 20 */ u32 unk_20;

    astruct_27(Disposition * proc, char * label, u32 param_2)
    {
        DisposGroup * group;

        this->unk_18 = 0;
        this->unk_20 = param_2;
        this->unk_0c = label;
        this->unk_00 = proc;
        func_ov000_021d9d7c(proc, this);
        this->unk_1c = 0;

        group = static_cast<DisposGroup *>(gMapStateManager->unk_18);

        if (group == NULL)
        {
            delete this;
        }
        else
        {
            while (TRUE)
            {
                if (group->unk_00 == NULL)
                {
                    group = NULL;
                    break;
                }

                if (func_020b6e2c(label, group->unk_00) == 0)
                {
                    break;
                }

                group++;
            }

            this->unk_10 = group;

            if (group == NULL)
            {
                delete this;
            }
            else
            {
                this->unk_14 = group->unk_04;
                func_ov000_021daac8(this);
            }
        }
    }

    ~astruct_27()
    {
        func_ov000_021d9e38(this);
        func_ov000_021d9da8(this->unk_00, this);
    }
};

struct TMP
{
    STRUCT_PAD(0x00, 0x54);
    u16 unk_54;
    STRUCT_PAD(0x56, 0x68);
    u32 unk_68;
};

EC struct TMP * func_ov000_021bb4c8(void *);
EC struct TMP * func_ov000_021bb210(void *, struct Unit *);

EC s32 GetPersonDBIndex(struct PersonData *);

EC void func_02039ff8(struct Unit *, Spawn *);
EC void func_0203bd34(struct Unit *, s32, s32);

struct Unknown_02197254
{
    void * unk_00;
    void * unk_04;
    /* 08 */ struct PersonData * pPerson;
    /* 0C */ struct JobData * pJob;
    /* 10 */ struct ItemData * pItem;
    STRUCT_PAD(0x14, 0x20);
    /* 20 */ struct TerrainData * pTerrain;
    STRUCT_PAD(0x24, 0x2C);
    /* 2C */ u8 * pWeaponLevel;
    STRUCT_PAD(0x30, 0x38);
    /* 38 */ struct Unit_unk_a4 ** unk_38;
    STRUCT_PAD(0x3C, 0x48);
    /* 48 */ struct DBFE11Footer * pDBFE11Footer;
};

extern struct Unknown_02197254 * data_02197254; // FE11 database

EC void func_01ff8204(void *, s8, s8, s32, s32, u16);

struct UnkStruct_02196f0c
{
    /* 00 */ struct UnkStruct_02196f0c_00 * unk_00;
    /* 04 */ void * flagMgr;
    /* 08 */ void * valueMgr;
    /* 0C */ u32 state;
    /* 10 */ u32 unk_10;
    /* 14 */ u32 unk_14;
};

extern struct UnkStruct_02196f0c * data_02196f0c;

EC struct Unit ** func_02040c98(s32);
EC s32 func_02040c74(struct Unit **);
EC struct Unit * func_02040d44(struct Unit **, s32);
EC BOOL func_0203fd60(s32, s32);

EC BOOL func_ov000_021a47e4(void);

EC struct Unit * func_ov000_021d9e50(astruct_27 *, s32, s32);

EC BOOL func_ov000_021bb5d4(void *, s32, s32);
EC void func_ov000_021dab34(astruct_27 *, BOOL, BOOL);

EC void func_ov000_021db160(astruct_27 *);
EC void func_ov000_021da8f4(astruct_27 *);
EC void func_ov000_021db1f4(astruct_27 *);

EC void func_0204bf74(void);

EC void func_ov000_021da0fc(astruct_27 *, s32);
EC void func_ov000_021da3c0(astruct_27 *, s32, s32);

struct UnkStruct_021e3528
{
    s8 unk_00[0x2e];
    s8 unk_2e;
    s8 unk_2f;
};

extern struct UnkStruct_021e3528 data_ov000_021e3528;

static inline BOOL BoundsCheck(s32 param_1, s32 param_2)
{
    if (param_1 < gMapStateManager->unk_24)
    {
        return TRUE;
    }
