#include "global.h"

#include <new>

#include "unit.h"
#include "unknown_data.h"
#include "unknown_funcs.h"

#include "proc_ex.hpp"
#include "sound_manager.hpp"
#include "state_manager.hpp"

extern struct UnkStruct_02196f0c * data_02196f0c;

class UnkStruct_021e334c
{
public:
    /* 00 */ STRUCT_PAD(0x00, 0x24);

    UnkStruct_021e334c(); // func_ov000_021b0f60
    ~UnkStruct_021e334c(); // func_ov000_021b1054
};

extern struct UnkStruct_021e334c * data_ov000_021e334c;

struct UnkStruct_021E3324_04_00
{
    /* 00 */ STRUCT_PAD(0x00, 0x14);
    /* 14 */ u16 unk_14;
    /* 16 */ u16 unk_16;
    /* 18 */ STRUCT_PAD(0x18, 0x24);
};

class UnkStruct_021E3324_04_04
{
public:
    /* 00 */ struct Unit * unk_00;
    /* 04 */ u32 unk_04;
    /* 08 */ u32 unk_08;

    UnkStruct_021E3324_04_04()
    {
        this->unk_00 = 0;
        this->unk_04 = 0;
        this->unk_08 = 0;
    }
};

struct UnkStruct_021E3324_04_08
{
    /* 000 */ STRUCT_PAD(0x000, 0x854);
    /* 854 */ s8 * unk_854;
};

struct UnkStruct_021E3324_04_0C
{
    /* 00 */ STRUCT_PAD(0x00, 0x28);
};

struct UnkStruct_021E3324_04_10
{
    /* 00 */ s8 unk_00[2];
    /* 02 */ s8 unk_02[2];
    /* 04 */ STRUCT_PAD(0x04, 0x08);
    /* 08 */ u8 unk_08;
    /* 09 */ u8 unk_09;
    /* 0A */ STRUCT_PAD(0x0A, 0x1A);
};

EC void func_ov000_021b9a1c(struct UnkStruct_021E3324_04_14 *);

class UnkStruct_021E3324_04_14_04
{
public:
    /* 00 */ STRUCT_PAD(0x00, 0x17);
    /* 17 */ u8 unk_17;
    /* 18 */ u8 unk_18;
};

class UnkStruct_021E3324_04_14
{
public:
    /* 00 */ u32 unk_00;
    /* 04 */ UnkStruct_021E3324_04_14_04 * unk_04;
    /* 08 */ u32 unk_08;
    /* 0C */ u32 unk_0c;
    /* 10 */ u32 unk_10;
    /* 14 */ u32 unk_14;
    /* 18 */ u32 unk_18;
    /* 1C */ u32 unk_1c;
    /* 20 */ u32 unk_20;
    /* 24 */ u8 unk_24;
    /* 25 */ u8 unk_25;
    /* 26 */ u8 unk_26;
    /* 27 */ u8 unk_27;
    /* 28 */ u8 unk_28;
    /* 29 */ u8 unk_29;
    /* 2A */ u8 unk_2a;
    /* 2B */ u8 unk_2b;
    /* 2C */ u32 unk_2c;

    UnkStruct_021E3324_04_14()
    {
        this->unk_00 = 0;
        this->unk_04 = 0;
        this->unk_08 = 0;
        this->unk_0c = 0;
        this->unk_10 = 0;
        this->unk_14 = 0;
        this->unk_18 = 0;
        this->unk_1c = 0;
        this->unk_20 = 0;
        this->unk_25 = 0;
        this->unk_26 = 0;
        this->unk_29 = 0;
        this->unk_27 = 0;
        this->unk_28 = 0;
        this->unk_2c = 0;
    }

    ~UnkStruct_021E3324_04_14()
    {
        func_ov000_021b9a1c(this);
    }
};

class UnkStruct_021E3324_04_1C
{
public:
    /* 00 */ void * unk_00;
    /* 04 */ void * unk_04;
    /* 08 */ u32 unk_08;
    /* 0C */ u8 unk_0c;

    UnkStruct_021E3324_04_1C()
    {
        void * ret = func_01ffb934(data_027e1b9c, 0x4000);
        this->unk_04 = ret;
        this->unk_00 = ret;
        this->unk_08 = 0x4000;
        this->unk_0c = 1;
    }

    ~UnkStruct_021E3324_04_1C()
    {
        if (this->unk_0c != 0)
        {
            func_01ffbb90(data_027e1b9c, this->unk_00);
        }
    }
};

class UnkStruct_021E3324_04
{
public:
    /* 000 */ struct UnkStruct_021E3324_04_00 * unk_00;
    /* 004 */ struct UnkStruct_021E3324_04_04 * unk_04;
    /* 008 */ struct UnkStruct_021E3324_04_08 * unk_08;
    /* 00C */ struct UnkStruct_021E3324_04_0C * unk_0c;
    /* 010 */ struct UnkStruct_021E3324_04_10 * unk_10;
    /* 014 */ struct UnkStruct_021E3324_04_14 * unk_14;
    /* 018 */ void * unk_18;
    /* 01C */ struct UnkStruct_021E3324_04_1C * unk_1c;
    /* 020 */ u16 unk_20;
    /* 022 */ u16 unk_22;
    /* 024 */ u8 unk_24;
    /* 025 */ u8 unk_25;
    /* 026 */ u8 unk_26;
    /* 027 */ u8 unk_27;
    /* 028 */ u8 unk_028[0x400];
    /* 428 */ u8 unk_428[0x400];
    /* 828 */ u8 * unk_828;
    /* 82C */ u8 * unk_82c;
    /* 830 */ u8 unk_830[0x400];
    /* C30 */ u8 unk_c30[0x80];
    /* CB0 */ u8 unk_cb0[0x80];
    /* D30 */ u8 unk_d30[0x80];
    /* DB0 */ u8 unk_db0[0x80];
    /* E30 */ u8 unk_e30[0x80];
    /* EB0 */ s8 unk_eb0[4];
    /* EB4 */ s8 unk_eb4[4];
    /* EB8 */ u8 unk_eb8;
    /* EB9 */ STRUCT_PAD(0xEB9, 0xEBC);

    UnkStruct_021E3324_04(); // func_ov000_021a2620
    ~UnkStruct_021E3324_04(); // func_ov000_021a26e8
};

extern struct UnkStruct_021974fc * data_021974fc;

EC struct UnkStruct_021E3324_04 * func_ov000_021a2620(struct UnkStruct_021E3324_04 *);
EC void func_ov000_021a276c(struct UnkStruct_021E3324_04 *, char *);

EC struct UnkStruct_021e334c * func_ov000_021b0f60(struct UnkStruct_021e334c *);
EC void func_ov000_021d4874(void);
EC void func_ov000_021a28cc(struct UnkStruct_021E3324_04 *);
EC void func_0204f080(struct UnkStruct_021974fc *);

EC void func_ov000_021a2918(struct UnkStruct_021E3324_04 *);
EC void func_ov000_021a2eb0(struct UnkBuf_Func_02049564 *, s32);
EC void func_ov000_021a29f4(struct UnkStruct_021E3324_04 *);

EC void func_ov000_021a4a7c(UnkStruct_021E3324_04_00 *);
EC void func_ov000_021a5318(UnkStruct_021E3324_04_0C *);
EC void func_ov000_021a68c0(UnkStruct_021E3324_04_10 *);
