#include "global.h"

#include <new>

#include "hardware.hpp"
#include "hashtable.hpp"
#include "map.hpp"
#include "proc_ex.hpp"
#include "sound_manager.hpp"

EC void func_0206ce8c(s32);
EC void func_0206d2e8(s32, s32, s32, s32, s32, s32, s32);

namespace anime
{
class Effect;
}

class Anime;

struct Anime_3c_10
{
    /* 00 */ u16 unk_00;
    /* 02 */ u8 unk_02;
    /* 03 */ u8 unk_03;
    /* 04 */ u8 unk_04;
    /* 05 */ u8 unk_05;
    /* 06 */ s16 unk_06;
    /* 08 */ s16 unk_08;
    /* 0A */ s16 unk_0a;
    /* 0C */ u8 unk_0c;
    /* 0D */ u8 unk_0d;
    /* 0E */ u8 unk_0e;
    /* 0F */ u8 unk_0f;
};

class Anime_3c
{
public:
    /* 00 */ Anime * unk_00;
    /* 04 */ Anime_3c * unk_04;
    /* 08 */ Anime_3c * unk_08;
    /* 0C */ s32 * unk_0c;
    /* 10 */ struct Anime_3c_10 * unk_10;
    /* 14 */ s32 unk_14; // TODO: probably a pointer?
    /* 18 */ s32 unk_18; // TODO: probably a pointer?
    /* 1C */ struct Anime_3c_10 * unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s16 unk_24;
    /* 26 */ s16 unk_26;
    /* 28 */ u16 unk_28;
    /* 2A */ u16 unk_2a;
    /* 2C */ u32 unk_2c;
    /* 30 */ u16 unk_30;
    /* 32 */ u8 unk_32;
    /* 33 */ u8 unk_33;
    /* 34 */ u16 unk_34;
    /* 36 */ u8 unk_36;
    /* 37 */ u8 unk_37;
    /* 38 */ u8 unk_38;
    /* 39 */ u8 unk_39;
    /* 3A */ u8 unk_3a;
    /* 3B */ STRUCT_PAD(0x3B, 0x3C);

    Anime_3c(Anime *, void *, u16, u16, u16, u16, s32); // func_02019d80
    Anime_3c(Anime_3c *, u32); // func_02019e60
};

class Anime : public ProcEx
{
public:
    /* 38 */ void (*unk_38)(Anime *);
    /* 3C */ Anime_3c * unk_3c;
    /* 40 */ anime::Effect * unk_40;
    /* 44 */ void * unk_44;
    /* 48 */ s32 unk_48;
    /* 4C */ u8 unk_4c;

    Anime(void *, u16, u16, u16, u16, s32, u8); // func_0201ad9c

    virtual ~Anime();

    void func_02019f88(s32);
};

namespace anime
{
class Effect
{
public:
    /* 00 */ // vtable
    /* 04 */ Anime * unk_04;
    /* 08 */ Effect * unk_08;
    /* 0C */ Effect * unk_0c;

    Effect(Anime *);

    virtual void vfunc_00(void); // func_0201ad98

    // func_0201b050
    // func_0201ac88
    virtual ~Effect() {

    };
};

class EffectAlpha3D : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;

    EffectAlpha3D(Anime * anime, s32 b, s32 c);

    virtual void vfunc_00(void); // func_0201bba8
    // func_0201bb24
    // func_0201bb48
    virtual ~EffectAlpha3D();
};

class EffectBright : public Effect
{
public:
    /* 10 */ u32 unk_10;
    /* 14 */ u32 unk_14;
    /* 18 */ u32 unk_18;
    /* 1C */ u32 unk_1c;

    EffectBright(Anime * anime, s32 b, s32 c);

    virtual void vfunc_00(void); // func_0201b134
    // func_0201b0a8
    // func_0201b0cc
    virtual ~EffectBright();
};

class EffectBlend : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s32 unk_24;

    EffectBlend(Anime * anime, s32 b, s32 c, s32 d); // func_0201b1b4

    virtual void vfunc_00(void); // func_0201b538
    // func_0201b21c
    // func_0201b244
    virtual ~EffectBlend();
};

class EffectBGBlend : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s32 unk_24;

    EffectBGBlend(Anime * anime, s32 b, s32 c, s32 d); // func_0201b5b4

    virtual void vfunc_00(void); // func_0201b938
    // func_0201b61c
    // func_0201b644
    virtual ~EffectBGBlend();
};

} // namespace anime

// func_02019d80
Anime_3c::Anime_3c(Anime * arg0, void * arg1, u16 arg2, u16 arg3, u16 arg4, u16 arg5, s32 arg6)
{
    this->unk_0c = (s32 *)arg1;
    this->unk_38 = arg2;
    this->unk_14 = (s32)arg1 + this->unk_0c[0];
    this->unk_18 = (s32)arg1 + this->unk_0c[1];
    this->unk_10 = (struct Anime_3c_10 *)((u8 *)this->unk_0c + (this->unk_0c + this->unk_38)[2]);

    this->unk_24 = arg3 & 0x1ff;

    if ((arg3 & 0x100) != 0)
    {
        this->unk_24 |= 0xfe00;
    }

    this->unk_26 = arg4 & 0xff;

    if (arg4 >= 0xc0)
    {
        this->unk_26 |= 0xff00;
    }

    this->unk_28 = arg3 & 0xfe00;
    this->unk_2a = arg4 & 0xff00;

    this->unk_34 = arg5;
    this->unk_2c = 0;
    this->unk_30 = 0;
    this->unk_32 = 0;
