#include "global.h"

#include <new>

#include "hardware.hpp"
#include "hashtable.hpp"
#include "map.hpp"
#include "proc_ex.hpp"
#include "sound_manager.hpp"

EC void func_02012180(char *);
EC s32 func_020b6de0(char *); // strlen?
EC void func_020b6c98(char *, char *); // strcpy?

EC void func_020a58b8(void *, void *, s32);

EC void func_0206e66c(struct VmMap_Common *, char *);
EC void func_0206e69c(struct VmMap_Common *, char *);
EC void func_0206e724(struct VmMap_Common *, char *, s32);

EC s32 Interpolate(s32, s32, s32, s32, s32);
EC s32 IntSys_Div(s32, s32);

EC void func_01ff9948(s32);
EC void func_01ffb574(s32, s16, s16, s16, s16); // SetObjAffine?
EC void func_01ffbb90(void *, void *);
EC void func_01ffc4e4(s16, s16, u16, u16, s32, s32, s32);
EC void func_01ffc614(s16, s16, u16, u16, s32, s32, s32);
EC void func_01ffc668(s16, s16, u16, u16, s32, s32, s32);

EC void func_0201b9b4(char *, char *);
EC void func_0201ba90(void);
EC void func_ov000_021d39a4(s32, s32, s32);
EC void func_ov000_021d3a2c(void);
EC s32 func_ov000_021d6f7c(s32);

EC void * func_02011920(char *, BOOL);

EC void func_0206ce8c(s32);
EC void func_0206d2e8(s32, s32, s32, s32, s32, s32, s32);

namespace anime
{
class Effect;
}

class Anime;

struct Anime_3c_10
{
    /* 00 */ u16 unk_00;
    /* 02 */ u8 unk_02;
    /* 03 */ u8 unk_03;
    /* 04 */ u8 unk_04;
    /* 05 */ u8 unk_05;
    /* 06 */ s16 unk_06;
    /* 08 */ s16 unk_08;
    /* 0A */ s16 unk_0a;
    /* 0C */ u8 unk_0c;
    /* 0D */ u8 unk_0d;
    /* 0E */ u8 unk_0e;
    /* 0F */ u8 unk_0f;
};

class Anime_3c
{
public:
    /* 00 */ Anime * unk_00;
    /* 04 */ Anime_3c * unk_04;
    /* 08 */ Anime_3c * unk_08;
    /* 0C */ s32 * unk_0c;
    /* 10 */ struct Anime_3c_10 * unk_10;
    /* 14 */ s32 unk_14; // TODO: probably a pointer?
    /* 18 */ s32 unk_18; // TODO: probably a pointer?
    /* 1C */ struct Anime_3c_10 * unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s16 unk_24;
    /* 26 */ s16 unk_26;
    /* 28 */ u16 unk_28;
    /* 2A */ u16 unk_2a;
    /* 2C */ u32 unk_2c;
    /* 30 */ u16 unk_30;
    /* 32 */ u8 unk_32;
    /* 33 */ u8 unk_33;
    /* 34 */ u16 unk_34;
    /* 36 */ u8 unk_36;
    /* 37 */ u8 unk_37;
    /* 38 */ u8 unk_38;
    /* 39 */ u8 unk_39;
    /* 3A */ u8 unk_3a;
    /* 3B */ STRUCT_PAD(0x3B, 0x3C);

    Anime_3c(Anime *, void *, u16, u16, u16, u16, s32); // func_02019d80
    Anime_3c(Anime_3c *, u32); // func_02019e60

    void func_02019f40(u8 arg2);
    void func_02019f68(u32 arg2, u32 arg3);
    void func_02019f88(BOOL arg2);
    void func_02019fa0(BOOL arg2);
    void func_02019fcc(BOOL arg2);
    void func_02019ff8(s32 arg2);
    void func_0201a014(s32 arg2, s32 arg3, s32 arg4, s32 arg5, u8 arg6);
    void func_0201a078(s32 arg2);
    void func_0201a094(s32 arg2);
    void func_0201a0b0(BOOL arg2);
    void func_0201a0dc(BOOL arg2);
    void func_0201a108(BOOL arg2);
    void func_0201a134(s32 arg2);
    void func_0201a150(void);
    void func_0201a1b4(void);
    void func_0201a1fc(void);
    void func_0201a5b0(void);
    void func_0201a874(void);
    void func_0201a894(s32 arg1, s32 arg2);
};

class Anime : public ProcEx
{
public:
    /* 38 */ void (*unk_38)(Anime *);
    /* 3C */ Anime_3c * unk_3c;
    /* 40 */ anime::Effect * unk_40;
    /* 44 */ void * unk_44;
    /* 48 */ s32 unk_48;
    /* 4C */ u8 unk_4c;

    Anime(void *, u16, u16, u16, u16, s32, u8); // func_0201ad9c

    virtual ~Anime();

    void func_0201af04(void);
    void func_0201af4c(void);
};

namespace anime
{
class Effect
{
public:
    /* 00 */ // vtable
    /* 04 */ Anime * unk_04;
    /* 08 */ Effect * unk_08;
    /* 0C */ Effect * unk_0c;

    Effect(Anime *);

    void func_0201ac14(void);
    void func_0201ac9c(void);
    void func_0201acdc(void);
    void func_0201ad70(void);

    virtual void vfunc_00(void); // func_0201ad98

    // func_0201b050
    // func_0201ac88
    virtual ~Effect() {};
};

class EffectAlpha3D : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;

    EffectAlpha3D(Anime * anime, s32 b, s32 c);

    s32 func_0201bb74(void);
    void func_0201bb8c(s32);

    virtual void vfunc_00(void); // func_0201bba8
    // func_0201bb24
    // func_0201bb48
    virtual ~EffectAlpha3D();
};

class EffectBright : public Effect
{
public:
    /* 10 */ u32 unk_10;
    /* 14 */ u32 unk_14;
    /* 18 */ u32 unk_18;
    /* 1C */ u32 unk_1c;

    EffectBright(Anime * anime, s32 b, s32 c);

    s32 func_0201b0f8(void);
    void func_0201b118(s32 arg2);

    virtual void vfunc_00(void); // func_0201b134
    // func_0201b0a8
    // func_0201b0cc
    virtual ~EffectBright();
};

class EffectBlend : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s32 unk_24;

    EffectBlend(Anime * anime, s32 b, s32 c, s32 d); // func_0201b1b4

    s32 func_0201b274(void);
    s32 func_0201b2d0(void);
    void func_0201b32c(s32, s32);

    virtual void vfunc_00(void); // func_0201b538
    // func_0201b21c
    // func_0201b244
    virtual ~EffectBlend();
};

class EffectBGBlend : public Effect
{
public:
    /* 10 */ s32 unk_10;
    /* 14 */ s32 unk_14;
    /* 18 */ s32 unk_18;
    /* 1C */ s32 unk_1c;
    /* 20 */ s32 unk_20;
    /* 24 */ s32 unk_24;

    EffectBGBlend(Anime * anime, s32 b, s32 c, s32 d); // func_0201b5b4

    s32 func_0201b674(void);
    s32 func_0201b6d0(void);
    void func_0201b72c(s32, s32);

    virtual void vfunc_00(void); // func_0201b938
    // func_0201b61c
    // func_0201b644
    virtual ~EffectBGBlend();
};

} // namespace anime

// func_02019d80
Anime_3c::Anime_3c(Anime * arg0, void * arg1, u16 arg2, u16 arg3, u16 arg4, u16 arg5, s32 arg6)
{
    this->unk_0c = (s32 *)arg1;
    this->unk_38 = arg2;
    this->unk_14 = (s32)arg1 + this->unk_0c[0];
    this->unk_18 = (s32)arg1 + this->unk_0c[1];
    this->unk_10 = (struct Anime_3c_10 *)((u8 *)this->unk_0c + (this->unk_0c + this->unk_38)[2]);

    this->unk_24 = arg3 & 0x1ff;

    if ((arg3 & 0x100) != 0)
    {
        this->unk_24 |= 0xfe00;
    }

    this->unk_26 = arg4 & 0xff;

    if (arg4 >= 0xc0)
    {
        this->unk_26 |= 0xff00;
    }

    this->unk_28 = arg3 & 0xfe00;
    this->unk_2a = arg4 & 0xff00;

